zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K39_DCM_GPR.h
/*
 * Copyright 1997-2016 Freescale Semiconductor, Inc.
 * Copyright 2016-2022 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/*!
 * @file S32K39_DCM_GPR.h
 * @version 1.7
 * @date 2022-11-18
 * @brief Peripheral Access Layer for S32K39_DCM_GPR
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* Prevention from multiple including the same memory map */
#if !defined(S32K39_DCM_GPR_H_)  /* Check if memory map has not been already included */
#define S32K39_DCM_GPR_H_

#include "S32K39_COMMON.h"

/* ----------------------------------------------------------------------------
   -- DCM_GPR Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup DCM_GPR_Peripheral_Access_Layer DCM_GPR Peripheral Access Layer
 * @{
 */

/** DCM_GPR - Register Layout Typedef */
typedef struct {
  uint8_t RESERVED_0[512];
  __IO uint32_t DCMROD1;                           /**< Read-Only GPR On Destructive Reset 1, offset: 0x200 */
  uint8_t RESERVED_1[4];
  __IO uint32_t DCMROD3;                           /**< Read-Only GPR On Destructive Reset 3, offset: 0x208 */
  __IO uint32_t DCMROD4;                           /**< Read-Only GPR On Destructive Reset 4, offset: 0x20C */
  __IO uint32_t DCMROD5;                           /**< Read-Only GPR On Destructive Reset 5, offset: 0x210 */
  __IO uint32_t DCMROD6;                           /**< Read-Only GPR On Destructive Reset 6, offset: 0x214 */
  __IO uint32_t DCMROD7;                           /**< Read-Only GPR On Destructive Reset 7, offset: 0x218 */
  uint8_t RESERVED_2[228];
  __IO uint32_t DCMROF1;                           /**< Read-Only GPR On Functional Reset 1, offset: 0x300 */
  __IO uint32_t DCMROF2;                           /**< Read-Only GPR On Functional Reset 2, offset: 0x304 */
  __IO uint32_t DCMROF3;                           /**< Read-Only GPR On Functional Reset 3, offset: 0x308 */
  __IO uint32_t DCMROF4;                           /**< Read-Only GPR On Functional Reset 4, offset: 0x30C */
  __IO uint32_t DCMROF5;                           /**< Read-Only GPR On Functional Reset 5, offset: 0x310 */
  __IO uint32_t DCMROF6;                           /**< Read-Only GPR On Functional Reset 6, offset: 0x314 */
  __IO uint32_t DCMROF7;                           /**< Read-Only GPR On Functional Reset 7, offset: 0x318 */
  __IO uint32_t DCMROF8;                           /**< Read-Only GPR On Functional Reset 8, offset: 0x31C */
  __IO uint32_t DCMROF9;                           /**< Read-Only GPR On Functional Reset 9, offset: 0x320 */
  __IO uint32_t DCMROF10;                          /**< Read-Only GPR On Functional Reset 10, offset: 0x324 */
  __IO uint32_t DCMROF11;                          /**< Read-Only GPR On Functional Reset 11, offset: 0x328 */
  __IO uint32_t DCMROF12;                          /**< Read-Only GPR On Functional Reset 12, offset: 0x32C */
  __IO uint32_t DCMROF13;                          /**< Read-Only GPR On Functional Reset 13, offset: 0x330 */
  __IO uint32_t DCMROF14;                          /**< Read-Only GPR On Functional Reset 14, offset: 0x334 */
  __IO uint32_t DCMROF15;                          /**< Read-Only GPR On Functional Reset 15, offset: 0x338 */
  __IO uint32_t DCMROF16;                          /**< Read-Only GPR On Functional Reset 16, offset: 0x33C */
  __IO uint32_t DCMROF17;                          /**< Read-Only GPR On Functional Reset 17, offset: 0x340 */
  uint8_t RESERVED_3[4];
  __I  uint32_t DCMROF19;                          /**< Read-Only GPR On Functional Reset 19, offset: 0x348 */
  __I  uint32_t DCMROF20;                          /**< Read-Only GPR On Functional Reset 20, offset: 0x34C */
  __I  uint32_t DCMROF21;                          /**< Read-Only GPR On Functional Reset 21, offset: 0x350 */
  uint8_t RESERVED_4[172];
  __IO uint32_t DCMRWP1;                           /**< Read Write GPR On POR 1, offset: 0x400 */
  uint8_t RESERVED_5[4];
  __IO uint32_t DCMRWP3;                           /**< Read Write GPR On POR 3, offset: 0x408 */
  uint8_t RESERVED_6[248];
  __IO uint32_t DCMRWD2;                           /**< Read Write GPR On Destructive Reset 2, offset: 0x504 */
  __IO uint32_t DCMRWD3;                           /**< Read Write GPR On Destructive Reset 3, offset: 0x508 */
  __IO uint32_t DCMRWD4;                           /**< Read Write GPR On Destructive Reset 4, offset: 0x50C */
  __IO uint32_t DCMRWD5;                           /**< Read Write GPR On Destructive Reset 5, offset: 0x510 */
  __IO uint32_t DCMRWD6;                           /**< Read Write GPR On Destructive Reset 6, offset: 0x514 */
  __IO uint32_t DCMRWD7;                           /**< Read Write GPR On Destructive Reset 7, offset: 0x518 */
  __IO uint32_t DCMRWD8;                           /**< Read Write GPR On Destructive Reset 8, offset: 0x51C */
  __IO uint32_t DCMRWD9;                           /**< Read Write GPR On Destructive Reset 9, offset: 0x520 */
  uint8_t RESERVED_7[8];
  __IO uint32_t DCMRWD12;                          /**< Read Write GPR On Destructive Reset 12, offset: 0x52C */
  __IO uint32_t DCMRWD13;                          /**< Read Write GPR On Destructive Reset 13, offset: 0x530 */
  __IO uint32_t DCMRWD14;                          /**< Read Write GPR On Destructive Reset 14, offset: 0x534 */
  __IO uint32_t DCMRWD15;                          /**< Read Write GPR On Destructive Reset 15, offset: 0x538 */
  uint8_t RESERVED_8[196];
  __IO uint32_t DCMRWF1;                           /**< Read Write GPR On Functional Reset 1, offset: 0x600 */
  __IO uint32_t DCMRWF2;                           /**< Read Write GPR On Functional Reset 2, offset: 0x604 */
  __IO uint32_t DCMRWF3;                           /**< Read Write GPR On Functional Reset 3, offset: 0x608 */
  __IO uint32_t DCMRWF4;                           /**< Read Write GPR On Functional Reset 4, offset: 0x60C */
  __IO uint32_t DCMRWF5;                           /**< Read Write GPR On Functional Reset 5, offset: 0x610 */
  uint8_t RESERVED_9[236];
  __IO uint32_t DCMROPP1;                          /**< Read-Only GPR On PMCPOR Reset 1, offset: 0x700 */
  __IO uint32_t DCMROPP2;                          /**< Read-Only GPR On PMCPOR Reset 2, offset: 0x704 */
  __IO uint32_t DCMROPP3;                          /**< Read-Only GPR On PMCPOR Reset 3, offset: 0x708 */
  __IO uint32_t DCMROPP4;                          /**< Read-Only GPR On PMCPOR Reset 4, offset: 0x70C */
} DCM_GPR_Type, *DCM_GPR_MemMapPtr;

/** Number of instances of the DCM_GPR module. */
#define DCM_GPR_INSTANCE_COUNT                   (1u)

