zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K39_DCM_GPR.h
#define DCM_GPR_DCMROD6_SAR_ADC0_CF_ERR_MASK     (0x800U)
#define DCM_GPR_DCMROD6_SAR_ADC0_CF_ERR_SHIFT    (11U)
#define DCM_GPR_DCMROD6_SAR_ADC0_CF_ERR_WIDTH    (1U)
#define DCM_GPR_DCMROD6_SAR_ADC0_CF_ERR(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD6_SAR_ADC0_CF_ERR_SHIFT)) & DCM_GPR_DCMROD6_SAR_ADC0_CF_ERR_MASK)

#define DCM_GPR_DCMROD6_SAR_ADC1_CF_ERR_MASK     (0x1000U)
#define DCM_GPR_DCMROD6_SAR_ADC1_CF_ERR_SHIFT    (12U)
#define DCM_GPR_DCMROD6_SAR_ADC1_CF_ERR_WIDTH    (1U)
#define DCM_GPR_DCMROD6_SAR_ADC1_CF_ERR(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD6_SAR_ADC1_CF_ERR_SHIFT)) & DCM_GPR_DCMROD6_SAR_ADC1_CF_ERR_MASK)

#define DCM_GPR_DCMROD6_SAR_ADC2_CF_ERR_MASK     (0x2000U)
#define DCM_GPR_DCMROD6_SAR_ADC2_CF_ERR_SHIFT    (13U)
#define DCM_GPR_DCMROD6_SAR_ADC2_CF_ERR_WIDTH    (1U)
#define DCM_GPR_DCMROD6_SAR_ADC2_CF_ERR(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD6_SAR_ADC2_CF_ERR_SHIFT)) & DCM_GPR_DCMROD6_SAR_ADC2_CF_ERR_MASK)

#define DCM_GPR_DCMROD6_SAR_ADC3_CF_ERR_MASK     (0x4000U)
#define DCM_GPR_DCMROD6_SAR_ADC3_CF_ERR_SHIFT    (14U)
#define DCM_GPR_DCMROD6_SAR_ADC3_CF_ERR_WIDTH    (1U)
#define DCM_GPR_DCMROD6_SAR_ADC3_CF_ERR(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD6_SAR_ADC3_CF_ERR_SHIFT)) & DCM_GPR_DCMROD6_SAR_ADC3_CF_ERR_MASK)

#define DCM_GPR_DCMROD6_SAR_ADC4_CF_ERR_MASK     (0x8000U)
#define DCM_GPR_DCMROD6_SAR_ADC4_CF_ERR_SHIFT    (15U)
#define DCM_GPR_DCMROD6_SAR_ADC4_CF_ERR_WIDTH    (1U)
#define DCM_GPR_DCMROD6_SAR_ADC4_CF_ERR(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD6_SAR_ADC4_CF_ERR_SHIFT)) & DCM_GPR_DCMROD6_SAR_ADC4_CF_ERR_MASK)

#define DCM_GPR_DCMROD6_SAR_ADC5_CF_ERR_MASK     (0x10000U)
#define DCM_GPR_DCMROD6_SAR_ADC5_CF_ERR_SHIFT    (16U)
#define DCM_GPR_DCMROD6_SAR_ADC5_CF_ERR_WIDTH    (1U)
#define DCM_GPR_DCMROD6_SAR_ADC5_CF_ERR(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD6_SAR_ADC5_CF_ERR_SHIFT)) & DCM_GPR_DCMROD6_SAR_ADC5_CF_ERR_MASK)

#define DCM_GPR_DCMROD6_SAR_ADC6_CF_ERR_MASK     (0x20000U)
#define DCM_GPR_DCMROD6_SAR_ADC6_CF_ERR_SHIFT    (17U)
#define DCM_GPR_DCMROD6_SAR_ADC6_CF_ERR_WIDTH    (1U)
#define DCM_GPR_DCMROD6_SAR_ADC6_CF_ERR(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD6_SAR_ADC6_CF_ERR_SHIFT)) & DCM_GPR_DCMROD6_SAR_ADC6_CF_ERR_MASK)

#define DCM_GPR_DCMROD6_ETPU_GLEX_ERR_MASK       (0x40000U)
#define DCM_GPR_DCMROD6_ETPU_GLEX_ERR_SHIFT      (18U)
#define DCM_GPR_DCMROD6_ETPU_GLEX_ERR_WIDTH      (1U)
#define DCM_GPR_DCMROD6_ETPU_GLEX_ERR(x)         (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD6_ETPU_GLEX_ERR_SHIFT)) & DCM_GPR_DCMROD6_ETPU_GLEX_ERR_MASK)

#define DCM_GPR_DCMROD6_OMU_0_ALARM_MASK         (0x80000U)
#define DCM_GPR_DCMROD6_OMU_0_ALARM_SHIFT        (19U)
#define DCM_GPR_DCMROD6_OMU_0_ALARM_WIDTH        (1U)
#define DCM_GPR_DCMROD6_OMU_0_ALARM(x)           (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD6_OMU_0_ALARM_SHIFT)) & DCM_GPR_DCMROD6_OMU_0_ALARM_MASK)

#define DCM_GPR_DCMROD6_OMU_1_ALARM_MASK         (0x100000U)
#define DCM_GPR_DCMROD6_OMU_1_ALARM_SHIFT        (20U)
#define DCM_GPR_DCMROD6_OMU_1_ALARM_WIDTH        (1U)
#define DCM_GPR_DCMROD6_OMU_1_ALARM(x)           (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD6_OMU_1_ALARM_SHIFT)) & DCM_GPR_DCMROD6_OMU_1_ALARM_MASK)

#define DCM_GPR_DCMROD6_OMU_2_ALARM_MASK         (0x200000U)
#define DCM_GPR_DCMROD6_OMU_2_ALARM_SHIFT        (21U)
#define DCM_GPR_DCMROD6_OMU_2_ALARM_WIDTH        (1U)
#define DCM_GPR_DCMROD6_OMU_2_ALARM(x)           (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD6_OMU_2_ALARM_SHIFT)) & DCM_GPR_DCMROD6_OMU_2_ALARM_MASK)

#define DCM_GPR_DCMROD6_CM7_2_RCCU1_ALARM_MASK   (0x400000U)
#define DCM_GPR_DCMROD6_CM7_2_RCCU1_ALARM_SHIFT  (22U)
#define DCM_GPR_DCMROD6_CM7_2_RCCU1_ALARM_WIDTH  (1U)
#define DCM_GPR_DCMROD6_CM7_2_RCCU1_ALARM(x)     (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD6_CM7_2_RCCU1_ALARM_SHIFT)) & DCM_GPR_DCMROD6_CM7_2_RCCU1_ALARM_MASK)

#define DCM_GPR_DCMROD6_CM7_2_RCCU2_ALARM_MASK   (0x800000U)
#define DCM_GPR_DCMROD6_CM7_2_RCCU2_ALARM_SHIFT  (23U)
#define DCM_GPR_DCMROD6_CM7_2_RCCU2_ALARM_WIDTH  (1U)
#define DCM_GPR_DCMROD6_CM7_2_RCCU2_ALARM(x)     (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD6_CM7_2_RCCU2_ALARM_SHIFT)) & DCM_GPR_DCMROD6_CM7_2_RCCU2_ALARM_MASK)

#define DCM_GPR_DCMROD6_eDMA1_RCCU1_ALARM_MASK   (0x1000000U)
#define DCM_GPR_DCMROD6_eDMA1_RCCU1_ALARM_SHIFT  (24U)
#define DCM_GPR_DCMROD6_eDMA1_RCCU1_ALARM_WIDTH  (1U)
#define DCM_GPR_DCMROD6_eDMA1_RCCU1_ALARM(x)     (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD6_eDMA1_RCCU1_ALARM_SHIFT)) & DCM_GPR_DCMROD6_eDMA1_RCCU1_ALARM_MASK)

#define DCM_GPR_DCMROD6_eDMA1_RCCU2_ALARM_MASK   (0x2000000U)
#define DCM_GPR_DCMROD6_eDMA1_RCCU2_ALARM_SHIFT  (25U)
#define DCM_GPR_DCMROD6_eDMA1_RCCU2_ALARM_WIDTH  (1U)
#define DCM_GPR_DCMROD6_eDMA1_RCCU2_ALARM(x)     (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD6_eDMA1_RCCU2_ALARM_SHIFT)) & DCM_GPR_DCMROD6_eDMA1_RCCU2_ALARM_MASK)

#define DCM_GPR_DCMROD6_DMA1_SYS_GSKT_ALARM_MASK (0x8000000U)
#define DCM_GPR_DCMROD6_DMA1_SYS_GSKT_ALARM_SHIFT (27U)
#define DCM_GPR_DCMROD6_DMA1_SYS_GSKT_ALARM_WIDTH (1U)
#define DCM_GPR_DCMROD6_DMA1_SYS_GSKT_ALARM(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD6_DMA1_SYS_GSKT_ALARM_SHIFT)) & DCM_GPR_DCMROD6_DMA1_SYS_GSKT_ALARM_MASK)

#define DCM_GPR_DCMROD6_DMA1_PERIPH_GSKT_ALARM_MASK (0x10000000U)
#define DCM_GPR_DCMROD6_DMA1_PERIPH_GSKT_ALARM_SHIFT (28U)
#define DCM_GPR_DCMROD6_DMA1_PERIPH_GSKT_ALARM_WIDTH (1U)
#define DCM_GPR_DCMROD6_DMA1_PERIPH_GSKT_ALARM(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD6_DMA1_PERIPH_GSKT_ALARM_SHIFT)) & DCM_GPR_DCMROD6_DMA1_PERIPH_GSKT_ALARM_MASK)

#define DCM_GPR_DCMROD6_ZIPWIRE_GSKT_ALARM_MASK  (0x20000000U)
#define DCM_GPR_DCMROD6_ZIPWIRE_GSKT_ALARM_SHIFT (29U)
#define DCM_GPR_DCMROD6_ZIPWIRE_GSKT_ALARM_WIDTH (1U)
#define DCM_GPR_DCMROD6_ZIPWIRE_GSKT_ALARM(x)    (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD6_ZIPWIRE_GSKT_ALARM_SHIFT)) & DCM_GPR_DCMROD6_ZIPWIRE_GSKT_ALARM_MASK)

#define DCM_GPR_DCMROD6_DMA1_AXBS_ALARM_MASK     (0x80000000U)
#define DCM_GPR_DCMROD6_DMA1_AXBS_ALARM_SHIFT    (31U)
#define DCM_GPR_DCMROD6_DMA1_AXBS_ALARM_WIDTH    (1U)
#define DCM_GPR_DCMROD6_DMA1_AXBS_ALARM(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD6_DMA1_AXBS_ALARM_SHIFT)) & DCM_GPR_DCMROD6_DMA1_AXBS_ALARM_MASK)
/*! @} */

/*! @name DCMROD7 - Read-Only GPR On Destructive Reset 7 */
/*! @{ */

