zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K39_DCM_GPR.h
#define DCM_GPR_DCMROD7_CM7_0_AHBM_ALARM_MASK    (0x1U)
#define DCM_GPR_DCMROD7_CM7_0_AHBM_ALARM_SHIFT   (0U)
#define DCM_GPR_DCMROD7_CM7_0_AHBM_ALARM_WIDTH   (1U)
#define DCM_GPR_DCMROD7_CM7_0_AHBM_ALARM(x)      (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD7_CM7_0_AHBM_ALARM_SHIFT)) & DCM_GPR_DCMROD7_CM7_0_AHBM_ALARM_MASK)

#define DCM_GPR_DCMROD7_CM7_1_AHBM_ALARM_MASK    (0x2U)
#define DCM_GPR_DCMROD7_CM7_1_AHBM_ALARM_SHIFT   (1U)
#define DCM_GPR_DCMROD7_CM7_1_AHBM_ALARM_WIDTH   (1U)
#define DCM_GPR_DCMROD7_CM7_1_AHBM_ALARM(x)      (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD7_CM7_1_AHBM_ALARM_SHIFT)) & DCM_GPR_DCMROD7_CM7_1_AHBM_ALARM_MASK)

#define DCM_GPR_DCMROD7_CM7_2_AHBM_ALARM_MASK    (0x4U)
#define DCM_GPR_DCMROD7_CM7_2_AHBM_ALARM_SHIFT   (2U)
#define DCM_GPR_DCMROD7_CM7_2_AHBM_ALARM_WIDTH   (1U)
#define DCM_GPR_DCMROD7_CM7_2_AHBM_ALARM(x)      (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD7_CM7_2_AHBM_ALARM_SHIFT)) & DCM_GPR_DCMROD7_CM7_2_AHBM_ALARM_MASK)

#define DCM_GPR_DCMROD7_CM7_0_AHBP_ALARM_MASK    (0x8U)
#define DCM_GPR_DCMROD7_CM7_0_AHBP_ALARM_SHIFT   (3U)
#define DCM_GPR_DCMROD7_CM7_0_AHBP_ALARM_WIDTH   (1U)
#define DCM_GPR_DCMROD7_CM7_0_AHBP_ALARM(x)      (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD7_CM7_0_AHBP_ALARM_SHIFT)) & DCM_GPR_DCMROD7_CM7_0_AHBP_ALARM_MASK)

#define DCM_GPR_DCMROD7_CM7_1_AHBP_ALARM_MASK    (0x10U)
#define DCM_GPR_DCMROD7_CM7_1_AHBP_ALARM_SHIFT   (4U)
#define DCM_GPR_DCMROD7_CM7_1_AHBP_ALARM_WIDTH   (1U)
#define DCM_GPR_DCMROD7_CM7_1_AHBP_ALARM(x)      (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD7_CM7_1_AHBP_ALARM_SHIFT)) & DCM_GPR_DCMROD7_CM7_1_AHBP_ALARM_MASK)

#define DCM_GPR_DCMROD7_CM7_2_AHBP_ALARM_MASK    (0x20U)
#define DCM_GPR_DCMROD7_CM7_2_AHBP_ALARM_SHIFT   (5U)
#define DCM_GPR_DCMROD7_CM7_2_AHBP_ALARM_WIDTH   (1U)
#define DCM_GPR_DCMROD7_CM7_2_AHBP_ALARM(x)      (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD7_CM7_2_AHBP_ALARM_SHIFT)) & DCM_GPR_DCMROD7_CM7_2_AHBP_ALARM_MASK)

#define DCM_GPR_DCMROD7_ZIPWIRE_AXBS_ALARM_MASK  (0x40U)
#define DCM_GPR_DCMROD7_ZIPWIRE_AXBS_ALARM_SHIFT (6U)
#define DCM_GPR_DCMROD7_ZIPWIRE_AXBS_ALARM_WIDTH (1U)
#define DCM_GPR_DCMROD7_ZIPWIRE_AXBS_ALARM(x)    (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD7_ZIPWIRE_AXBS_ALARM_SHIFT)) & DCM_GPR_DCMROD7_ZIPWIRE_AXBS_ALARM_MASK)

#define DCM_GPR_DCMROD7_LVDS_3P3V_RX_FAULT_MASK  (0x80U)
#define DCM_GPR_DCMROD7_LVDS_3P3V_RX_FAULT_SHIFT (7U)
#define DCM_GPR_DCMROD7_LVDS_3P3V_RX_FAULT_WIDTH (1U)
#define DCM_GPR_DCMROD7_LVDS_3P3V_RX_FAULT(x)    (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD7_LVDS_3P3V_RX_FAULT_SHIFT)) & DCM_GPR_DCMROD7_LVDS_3P3V_RX_FAULT_MASK)

#define DCM_GPR_DCMROD7_VDDA_SDADC0_GNG_ERR_MASK (0x100U)
#define DCM_GPR_DCMROD7_VDDA_SDADC0_GNG_ERR_SHIFT (8U)
#define DCM_GPR_DCMROD7_VDDA_SDADC0_GNG_ERR_WIDTH (1U)
#define DCM_GPR_DCMROD7_VDDA_SDADC0_GNG_ERR(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD7_VDDA_SDADC0_GNG_ERR_SHIFT)) & DCM_GPR_DCMROD7_VDDA_SDADC0_GNG_ERR_MASK)

#define DCM_GPR_DCMROD7_VDDA_SDADC1_GNG_ERR_MASK (0x200U)
#define DCM_GPR_DCMROD7_VDDA_SDADC1_GNG_ERR_SHIFT (9U)
#define DCM_GPR_DCMROD7_VDDA_SDADC1_GNG_ERR_WIDTH (1U)
#define DCM_GPR_DCMROD7_VDDA_SDADC1_GNG_ERR(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD7_VDDA_SDADC1_GNG_ERR_SHIFT)) & DCM_GPR_DCMROD7_VDDA_SDADC1_GNG_ERR_MASK)

#define DCM_GPR_DCMROD7_VDDA_SWG_GNG_ERR_MASK    (0x400U)
#define DCM_GPR_DCMROD7_VDDA_SWG_GNG_ERR_SHIFT   (10U)
#define DCM_GPR_DCMROD7_VDDA_SWG_GNG_ERR_WIDTH   (1U)
#define DCM_GPR_DCMROD7_VDDA_SWG_GNG_ERR(x)      (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD7_VDDA_SWG_GNG_ERR_SHIFT)) & DCM_GPR_DCMROD7_VDDA_SWG_GNG_ERR_MASK)

#define DCM_GPR_DCMROD7_VDD1P1_GNG2_ERR_MASK     (0x800U)
#define DCM_GPR_DCMROD7_VDD1P1_GNG2_ERR_SHIFT    (11U)
#define DCM_GPR_DCMROD7_VDD1P1_GNG2_ERR_WIDTH    (1U)
#define DCM_GPR_DCMROD7_VDD1P1_GNG2_ERR(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD7_VDD1P1_GNG2_ERR_SHIFT)) & DCM_GPR_DCMROD7_VDD1P1_GNG2_ERR_MASK)

#define DCM_GPR_DCMROD7_VDD2P5_GNG2_ERR_MASK     (0x1000U)
#define DCM_GPR_DCMROD7_VDD2P5_GNG2_ERR_SHIFT    (12U)
#define DCM_GPR_DCMROD7_VDD2P5_GNG2_ERR_WIDTH    (1U)
#define DCM_GPR_DCMROD7_VDD2P5_GNG2_ERR(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD7_VDD2P5_GNG2_ERR_SHIFT)) & DCM_GPR_DCMROD7_VDD2P5_GNG2_ERR_MASK)

#define DCM_GPR_DCMROD7_XMEM_EVEN_ECC_CORE_ERR_MASK (0x2000U)
#define DCM_GPR_DCMROD7_XMEM_EVEN_ECC_CORE_ERR_SHIFT (13U)
#define DCM_GPR_DCMROD7_XMEM_EVEN_ECC_CORE_ERR_WIDTH (1U)
#define DCM_GPR_DCMROD7_XMEM_EVEN_ECC_CORE_ERR(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD7_XMEM_EVEN_ECC_CORE_ERR_SHIFT)) & DCM_GPR_DCMROD7_XMEM_EVEN_ECC_CORE_ERR_MASK)

#define DCM_GPR_DCMROD7_PMEM_ECC_CORE_ERR_MASK   (0x4000U)
#define DCM_GPR_DCMROD7_PMEM_ECC_CORE_ERR_SHIFT  (14U)
#define DCM_GPR_DCMROD7_PMEM_ECC_CORE_ERR_WIDTH  (1U)
#define DCM_GPR_DCMROD7_PMEM_ECC_CORE_ERR(x)     (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD7_PMEM_ECC_CORE_ERR_SHIFT)) & DCM_GPR_DCMROD7_PMEM_ECC_CORE_ERR_MASK)

#define DCM_GPR_DCMROD7_XMEM_ODD_ECC0_DSP_ERR_MASK (0x8000U)
#define DCM_GPR_DCMROD7_XMEM_ODD_ECC0_DSP_ERR_SHIFT (15U)
#define DCM_GPR_DCMROD7_XMEM_ODD_ECC0_DSP_ERR_WIDTH (1U)
#define DCM_GPR_DCMROD7_XMEM_ODD_ECC0_DSP_ERR(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD7_XMEM_ODD_ECC0_DSP_ERR_SHIFT)) & DCM_GPR_DCMROD7_XMEM_ODD_ECC0_DSP_ERR_MASK)

#define DCM_GPR_DCMROD7_XMEM_ODD_ECC1_DSP_ERR_MASK (0x10000U)
#define DCM_GPR_DCMROD7_XMEM_ODD_ECC1_DSP_ERR_SHIFT (16U)
#define DCM_GPR_DCMROD7_XMEM_ODD_ECC1_DSP_ERR_WIDTH (1U)
#define DCM_GPR_DCMROD7_XMEM_ODD_ECC1_DSP_ERR(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD7_XMEM_ODD_ECC1_DSP_ERR_SHIFT)) & DCM_GPR_DCMROD7_XMEM_ODD_ECC1_DSP_ERR_MASK)

#define DCM_GPR_DCMROD7_XMEM_ODD_ECC2_DSP_ERR_MASK (0x20000U)
#define DCM_GPR_DCMROD7_XMEM_ODD_ECC2_DSP_ERR_SHIFT (17U)
#define DCM_GPR_DCMROD7_XMEM_ODD_ECC2_DSP_ERR_WIDTH (1U)
#define DCM_GPR_DCMROD7_XMEM_ODD_ECC2_DSP_ERR(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD7_XMEM_ODD_ECC2_DSP_ERR_SHIFT)) & DCM_GPR_DCMROD7_XMEM_ODD_ECC2_DSP_ERR_MASK)

#define DCM_GPR_DCMROD7_XMEM_ODD_ECC3_DSP_ERR_MASK (0x40000U)
#define DCM_GPR_DCMROD7_XMEM_ODD_ECC3_DSP_ERR_SHIFT (18U)
#define DCM_GPR_DCMROD7_XMEM_ODD_ECC3_DSP_ERR_WIDTH (1U)
#define DCM_GPR_DCMROD7_XMEM_ODD_ECC3_DSP_ERR(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD7_XMEM_ODD_ECC3_DSP_ERR_SHIFT)) & DCM_GPR_DCMROD7_XMEM_ODD_ECC3_DSP_ERR_MASK)

#define DCM_GPR_DCMROD7_XMEM_EVEN_ECC0_DSP_ERR_MASK (0x80000U)
#define DCM_GPR_DCMROD7_XMEM_EVEN_ECC0_DSP_ERR_SHIFT (19U)
#define DCM_GPR_DCMROD7_XMEM_EVEN_ECC0_DSP_ERR_WIDTH (1U)
#define DCM_GPR_DCMROD7_XMEM_EVEN_ECC0_DSP_ERR(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD7_XMEM_EVEN_ECC0_DSP_ERR_SHIFT)) & DCM_GPR_DCMROD7_XMEM_EVEN_ECC0_DSP_ERR_MASK)

#define DCM_GPR_DCMROD7_XMEM_EVEN_ECC1_DSP_ERR_MASK (0x100000U)
#define DCM_GPR_DCMROD7_XMEM_EVEN_ECC1_DSP_ERR_SHIFT (20U)
#define DCM_GPR_DCMROD7_XMEM_EVEN_ECC1_DSP_ERR_WIDTH (1U)
#define DCM_GPR_DCMROD7_XMEM_EVEN_ECC1_DSP_ERR(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD7_XMEM_EVEN_ECC1_DSP_ERR_SHIFT)) & DCM_GPR_DCMROD7_XMEM_EVEN_ECC1_DSP_ERR_MASK)

#define DCM_GPR_DCMROD7_XMEM_EVEN_ECC2_DSP_ERR_MASK (0x200000U)
#define DCM_GPR_DCMROD7_XMEM_EVEN_ECC2_DSP_ERR_SHIFT (21U)
#define DCM_GPR_DCMROD7_XMEM_EVEN_ECC2_DSP_ERR_WIDTH (1U)
#define DCM_GPR_DCMROD7_XMEM_EVEN_ECC2_DSP_ERR(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD7_XMEM_EVEN_ECC2_DSP_ERR_SHIFT)) & DCM_GPR_DCMROD7_XMEM_EVEN_ECC2_DSP_ERR_MASK)

#define DCM_GPR_DCMROD7_XMEM_EVEN_ECC3_DSP_ERR_MASK (0x400000U)
#define DCM_GPR_DCMROD7_XMEM_EVEN_ECC3_DSP_ERR_SHIFT (22U)
#define DCM_GPR_DCMROD7_XMEM_EVEN_ECC3_DSP_ERR_WIDTH (1U)
#define DCM_GPR_DCMROD7_XMEM_EVEN_ECC3_DSP_ERR(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD7_XMEM_EVEN_ECC3_DSP_ERR_SHIFT)) & DCM_GPR_DCMROD7_XMEM_EVEN_ECC3_DSP_ERR_MASK)

#define DCM_GPR_DCMROD7_PMEM_ECC0_DSP_ERR_MASK   (0x800000U)
#define DCM_GPR_DCMROD7_PMEM_ECC0_DSP_ERR_SHIFT  (23U)
#define DCM_GPR_DCMROD7_PMEM_ECC0_DSP_ERR_WIDTH  (1U)
#define DCM_GPR_DCMROD7_PMEM_ECC0_DSP_ERR(x)     (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD7_PMEM_ECC0_DSP_ERR_SHIFT)) & DCM_GPR_DCMROD7_PMEM_ECC0_DSP_ERR_MASK)

#define DCM_GPR_DCMROD7_PMEM_ECC1_DSP_ERR_MASK   (0x1000000U)
#define DCM_GPR_DCMROD7_PMEM_ECC1_DSP_ERR_SHIFT  (24U)
#define DCM_GPR_DCMROD7_PMEM_ECC1_DSP_ERR_WIDTH  (1U)
#define DCM_GPR_DCMROD7_PMEM_ECC1_DSP_ERR(x)     (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD7_PMEM_ECC1_DSP_ERR_SHIFT)) & DCM_GPR_DCMROD7_PMEM_ECC1_DSP_ERR_MASK)

#define DCM_GPR_DCMROD7_PMEM_ECC2_DSP_ERR_MASK   (0x2000000U)
#define DCM_GPR_DCMROD7_PMEM_ECC2_DSP_ERR_SHIFT  (25U)
#define DCM_GPR_DCMROD7_PMEM_ECC2_DSP_ERR_WIDTH  (1U)
#define DCM_GPR_DCMROD7_PMEM_ECC2_DSP_ERR(x)     (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD7_PMEM_ECC2_DSP_ERR_SHIFT)) & DCM_GPR_DCMROD7_PMEM_ECC2_DSP_ERR_MASK)

