zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K39_DCM_GPR.h
#define DCM_GPR_DCMROD7_PMEM_ECC3_DSP_ERR_MASK   (0x4000000U)
#define DCM_GPR_DCMROD7_PMEM_ECC3_DSP_ERR_SHIFT  (26U)
#define DCM_GPR_DCMROD7_PMEM_ECC3_DSP_ERR_WIDTH  (1U)
#define DCM_GPR_DCMROD7_PMEM_ECC3_DSP_ERR(x)     (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD7_PMEM_ECC3_DSP_ERR_SHIFT)) & DCM_GPR_DCMROD7_PMEM_ECC3_DSP_ERR_MASK)

#define DCM_GPR_DCMROD7_XMEM_ODD_ECC_CORE_ERR_MASK (0x8000000U)
#define DCM_GPR_DCMROD7_XMEM_ODD_ECC_CORE_ERR_SHIFT (27U)
#define DCM_GPR_DCMROD7_XMEM_ODD_ECC_CORE_ERR_WIDTH (1U)
#define DCM_GPR_DCMROD7_XMEM_ODD_ECC_CORE_ERR(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD7_XMEM_ODD_ECC_CORE_ERR_SHIFT)) & DCM_GPR_DCMROD7_XMEM_ODD_ECC_CORE_ERR_MASK)

#define DCM_GPR_DCMROD7_CM7_0_AHBS_ALARM_MASK    (0x10000000U)
#define DCM_GPR_DCMROD7_CM7_0_AHBS_ALARM_SHIFT   (28U)
#define DCM_GPR_DCMROD7_CM7_0_AHBS_ALARM_WIDTH   (1U)
#define DCM_GPR_DCMROD7_CM7_0_AHBS_ALARM(x)      (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD7_CM7_0_AHBS_ALARM_SHIFT)) & DCM_GPR_DCMROD7_CM7_0_AHBS_ALARM_MASK)

#define DCM_GPR_DCMROD7_CM7_1_AHBS_ALARM_MASK    (0x20000000U)
#define DCM_GPR_DCMROD7_CM7_1_AHBS_ALARM_SHIFT   (29U)
#define DCM_GPR_DCMROD7_CM7_1_AHBS_ALARM_WIDTH   (1U)
#define DCM_GPR_DCMROD7_CM7_1_AHBS_ALARM(x)      (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD7_CM7_1_AHBS_ALARM_SHIFT)) & DCM_GPR_DCMROD7_CM7_1_AHBS_ALARM_MASK)

#define DCM_GPR_DCMROD7_CM7_2_AHBS_ALARM_MASK    (0x40000000U)
#define DCM_GPR_DCMROD7_CM7_2_AHBS_ALARM_SHIFT   (30U)
#define DCM_GPR_DCMROD7_CM7_2_AHBS_ALARM_WIDTH   (1U)
#define DCM_GPR_DCMROD7_CM7_2_AHBS_ALARM(x)      (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD7_CM7_2_AHBS_ALARM_SHIFT)) & DCM_GPR_DCMROD7_CM7_2_AHBS_ALARM_MASK)
/*! @} */

/*! @name DCMROF1 - Read-Only GPR On Functional Reset 1 */
/*! @{ */

#define DCM_GPR_DCMROF1_EMAC_MDC_CHID_0_MASK     (0x1U)
#define DCM_GPR_DCMROF1_EMAC_MDC_CHID_0_SHIFT    (0U)
#define DCM_GPR_DCMROF1_EMAC_MDC_CHID_0_WIDTH    (1U)
#define DCM_GPR_DCMROF1_EMAC_MDC_CHID_0(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROF1_EMAC_MDC_CHID_0_SHIFT)) & DCM_GPR_DCMROF1_EMAC_MDC_CHID_0_MASK)

#define DCM_GPR_DCMROF1_EMAC_MDC_CHID_1_MASK     (0x2U)
#define DCM_GPR_DCMROF1_EMAC_MDC_CHID_1_SHIFT    (1U)
#define DCM_GPR_DCMROF1_EMAC_MDC_CHID_1_WIDTH    (1U)
#define DCM_GPR_DCMROF1_EMAC_MDC_CHID_1(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROF1_EMAC_MDC_CHID_1_SHIFT)) & DCM_GPR_DCMROF1_EMAC_MDC_CHID_1_MASK)
/*! @} */

/*! @name DCMROF2 - Read-Only GPR On Functional Reset 2 */
/*! @{ */

#define DCM_GPR_DCMROF2_DCF_SDID0_MASK           (0xFFFFFFFFU)
#define DCM_GPR_DCMROF2_DCF_SDID0_SHIFT          (0U)
#define DCM_GPR_DCMROF2_DCF_SDID0_WIDTH          (32U)
#define DCM_GPR_DCMROF2_DCF_SDID0(x)             (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROF2_DCF_SDID0_SHIFT)) & DCM_GPR_DCMROF2_DCF_SDID0_MASK)
/*! @} */

/*! @name DCMROF3 - Read-Only GPR On Functional Reset 3 */
/*! @{ */

#define DCM_GPR_DCMROF3_DCF_SDID1_MASK           (0xFFFFFFFFU)
#define DCM_GPR_DCMROF3_DCF_SDID1_SHIFT          (0U)
#define DCM_GPR_DCMROF3_DCF_SDID1_WIDTH          (32U)
#define DCM_GPR_DCMROF3_DCF_SDID1(x)             (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROF3_DCF_SDID1_SHIFT)) & DCM_GPR_DCMROF3_DCF_SDID1_MASK)
/*! @} */

/*! @name DCMROF4 - Read-Only GPR On Functional Reset 4 */
/*! @{ */

#define DCM_GPR_DCMROF4_DCF_SDID2_MASK           (0xFFFFFFFFU)
#define DCM_GPR_DCMROF4_DCF_SDID2_SHIFT          (0U)
#define DCM_GPR_DCMROF4_DCF_SDID2_WIDTH          (32U)
#define DCM_GPR_DCMROF4_DCF_SDID2(x)             (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROF4_DCF_SDID2_SHIFT)) & DCM_GPR_DCMROF4_DCF_SDID2_MASK)
/*! @} */

/*! @name DCMROF5 - Read-Only GPR On Functional Reset 5 */
/*! @{ */

#define DCM_GPR_DCMROF5_DCF_SDID3_MASK           (0xFFFFFFFFU)
#define DCM_GPR_DCMROF5_DCF_SDID3_SHIFT          (0U)
#define DCM_GPR_DCMROF5_DCF_SDID3_WIDTH          (32U)
#define DCM_GPR_DCMROF5_DCF_SDID3(x)             (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROF5_DCF_SDID3_SHIFT)) & DCM_GPR_DCMROF5_DCF_SDID3_MASK)
/*! @} */

/*! @name DCMROF6 - Read-Only GPR On Functional Reset 6 */
/*! @{ */

#define DCM_GPR_DCMROF6_DCF_SDID4_MASK           (0xFFFFFFFFU)
#define DCM_GPR_DCMROF6_DCF_SDID4_SHIFT          (0U)
#define DCM_GPR_DCMROF6_DCF_SDID4_WIDTH          (32U)
#define DCM_GPR_DCMROF6_DCF_SDID4(x)             (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROF6_DCF_SDID4_SHIFT)) & DCM_GPR_DCMROF6_DCF_SDID4_MASK)
/*! @} */

/*! @name DCMROF7 - Read-Only GPR On Functional Reset 7 */
/*! @{ */

#define DCM_GPR_DCMROF7_DCF_SDID5_MASK           (0xFFFFFFFFU)
#define DCM_GPR_DCMROF7_DCF_SDID5_SHIFT          (0U)
#define DCM_GPR_DCMROF7_DCF_SDID5_WIDTH          (32U)
#define DCM_GPR_DCMROF7_DCF_SDID5(x)             (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROF7_DCF_SDID5_SHIFT)) & DCM_GPR_DCMROF7_DCF_SDID5_MASK)
/*! @} */

/*! @name DCMROF8 - Read-Only GPR On Functional Reset 8 */
/*! @{ */

#define DCM_GPR_DCMROF8_DCF_SDID6_MASK           (0xFFFFFFFFU)
#define DCM_GPR_DCMROF8_DCF_SDID6_SHIFT          (0U)
#define DCM_GPR_DCMROF8_DCF_SDID6_WIDTH          (32U)
#define DCM_GPR_DCMROF8_DCF_SDID6(x)             (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROF8_DCF_SDID6_SHIFT)) & DCM_GPR_DCMROF8_DCF_SDID6_MASK)
/*! @} */

/*! @name DCMROF9 - Read-Only GPR On Functional Reset 9 */
/*! @{ */

#define DCM_GPR_DCMROF9_DCF_SDID7_MASK           (0xFFFFFFFFU)
#define DCM_GPR_DCMROF9_DCF_SDID7_SHIFT          (0U)
#define DCM_GPR_DCMROF9_DCF_SDID7_WIDTH          (32U)
#define DCM_GPR_DCMROF9_DCF_SDID7(x)             (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROF9_DCF_SDID7_SHIFT)) & DCM_GPR_DCMROF9_DCF_SDID7_MASK)
/*! @} */

/*! @name DCMROF10 - Read-Only GPR On Functional Reset 10 */
/*! @{ */

#define DCM_GPR_DCMROF10_DCF_SDID8_MASK          (0xFFFFFFFFU)
#define DCM_GPR_DCMROF10_DCF_SDID8_SHIFT         (0U)
#define DCM_GPR_DCMROF10_DCF_SDID8_WIDTH         (32U)
#define DCM_GPR_DCMROF10_DCF_SDID8(x)            (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROF10_DCF_SDID8_SHIFT)) & DCM_GPR_DCMROF10_DCF_SDID8_MASK)
/*! @} */

/*! @name DCMROF11 - Read-Only GPR On Functional Reset 11 */
/*! @{ */

#define DCM_GPR_DCMROF11_DCF_SDID9_MASK          (0xFFFFFFFFU)
#define DCM_GPR_DCMROF11_DCF_SDID9_SHIFT         (0U)
#define DCM_GPR_DCMROF11_DCF_SDID9_WIDTH         (32U)
#define DCM_GPR_DCMROF11_DCF_SDID9(x)            (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROF11_DCF_SDID9_SHIFT)) & DCM_GPR_DCMROF11_DCF_SDID9_MASK)
/*! @} */

/*! @name DCMROF12 - Read-Only GPR On Functional Reset 12 */
/*! @{ */

#define DCM_GPR_DCMROF12_DCF_SDID10_MASK         (0xFFFFFFFFU)
#define DCM_GPR_DCMROF12_DCF_SDID10_SHIFT        (0U)
#define DCM_GPR_DCMROF12_DCF_SDID10_WIDTH        (32U)
#define DCM_GPR_DCMROF12_DCF_SDID10(x)           (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROF12_DCF_SDID10_SHIFT)) & DCM_GPR_DCMROF12_DCF_SDID10_MASK)
/*! @} */

/*! @name DCMROF13 - Read-Only GPR On Functional Reset 13 */
/*! @{ */

#define DCM_GPR_DCMROF13_DCF_SDID11_MASK         (0xFFFFFFFFU)
#define DCM_GPR_DCMROF13_DCF_SDID11_SHIFT        (0U)
#define DCM_GPR_DCMROF13_DCF_SDID11_WIDTH        (32U)
#define DCM_GPR_DCMROF13_DCF_SDID11(x)           (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROF13_DCF_SDID11_SHIFT)) & DCM_GPR_DCMROF13_DCF_SDID11_MASK)
/*! @} */

/*! @name DCMROF14 - Read-Only GPR On Functional Reset 14 */
/*! @{ */

