zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K39_DCM_GPR.h
#define DCM_GPR_DCMRWD12_FLEXCAN1_DBG_DIS_CM7_2_MASK (0x2000000U)
#define DCM_GPR_DCMRWD12_FLEXCAN1_DBG_DIS_CM7_2_SHIFT (25U)
#define DCM_GPR_DCMRWD12_FLEXCAN1_DBG_DIS_CM7_2_WIDTH (1U)
#define DCM_GPR_DCMRWD12_FLEXCAN1_DBG_DIS_CM7_2(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD12_FLEXCAN1_DBG_DIS_CM7_2_SHIFT)) & DCM_GPR_DCMRWD12_FLEXCAN1_DBG_DIS_CM7_2_MASK)

#define DCM_GPR_DCMRWD12_FLEXCAN2_DBG_DIS_CM7_2_MASK (0x4000000U)
#define DCM_GPR_DCMRWD12_FLEXCAN2_DBG_DIS_CM7_2_SHIFT (26U)
#define DCM_GPR_DCMRWD12_FLEXCAN2_DBG_DIS_CM7_2_WIDTH (1U)
#define DCM_GPR_DCMRWD12_FLEXCAN2_DBG_DIS_CM7_2(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD12_FLEXCAN2_DBG_DIS_CM7_2_SHIFT)) & DCM_GPR_DCMRWD12_FLEXCAN2_DBG_DIS_CM7_2_MASK)

#define DCM_GPR_DCMRWD12_FLEXCAN3_DBG_DIS_CM7_2_MASK (0x8000000U)
#define DCM_GPR_DCMRWD12_FLEXCAN3_DBG_DIS_CM7_2_SHIFT (27U)
#define DCM_GPR_DCMRWD12_FLEXCAN3_DBG_DIS_CM7_2_WIDTH (1U)
#define DCM_GPR_DCMRWD12_FLEXCAN3_DBG_DIS_CM7_2(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD12_FLEXCAN3_DBG_DIS_CM7_2_SHIFT)) & DCM_GPR_DCMRWD12_FLEXCAN3_DBG_DIS_CM7_2_MASK)

#define DCM_GPR_DCMRWD12_FLEXCAN4_DBG_DIS_CM7_2_MASK (0x10000000U)
#define DCM_GPR_DCMRWD12_FLEXCAN4_DBG_DIS_CM7_2_SHIFT (28U)
#define DCM_GPR_DCMRWD12_FLEXCAN4_DBG_DIS_CM7_2_WIDTH (1U)
#define DCM_GPR_DCMRWD12_FLEXCAN4_DBG_DIS_CM7_2(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD12_FLEXCAN4_DBG_DIS_CM7_2_SHIFT)) & DCM_GPR_DCMRWD12_FLEXCAN4_DBG_DIS_CM7_2_MASK)

#define DCM_GPR_DCMRWD12_FLEXCAN5_DBG_DIS_CM7_2_MASK (0x20000000U)
#define DCM_GPR_DCMRWD12_FLEXCAN5_DBG_DIS_CM7_2_SHIFT (29U)
#define DCM_GPR_DCMRWD12_FLEXCAN5_DBG_DIS_CM7_2_WIDTH (1U)
#define DCM_GPR_DCMRWD12_FLEXCAN5_DBG_DIS_CM7_2(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD12_FLEXCAN5_DBG_DIS_CM7_2_SHIFT)) & DCM_GPR_DCMRWD12_FLEXCAN5_DBG_DIS_CM7_2_MASK)
/*! @} */

/*! @name DCMRWD13 - Read Write GPR On Destructive Reset 13 */
/*! @{ */

#define DCM_GPR_DCMRWD13_STM2_DBG_DIS_CM7_2_MASK (0x8U)
#define DCM_GPR_DCMRWD13_STM2_DBG_DIS_CM7_2_SHIFT (3U)
#define DCM_GPR_DCMRWD13_STM2_DBG_DIS_CM7_2_WIDTH (1U)
#define DCM_GPR_DCMRWD13_STM2_DBG_DIS_CM7_2(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD13_STM2_DBG_DIS_CM7_2_SHIFT)) & DCM_GPR_DCMRWD13_STM2_DBG_DIS_CM7_2_MASK)

#define DCM_GPR_DCMRWD13_SWT2_DBG_DIS_CM7_2_MASK (0x10U)
#define DCM_GPR_DCMRWD13_SWT2_DBG_DIS_CM7_2_SHIFT (4U)
#define DCM_GPR_DCMRWD13_SWT2_DBG_DIS_CM7_2_WIDTH (1U)
#define DCM_GPR_DCMRWD13_SWT2_DBG_DIS_CM7_2(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD13_SWT2_DBG_DIS_CM7_2_SHIFT)) & DCM_GPR_DCMRWD13_SWT2_DBG_DIS_CM7_2_MASK)

#define DCM_GPR_DCMRWD13_DIGRF_DBG_DIS_CM7_2_MASK (0x40U)
#define DCM_GPR_DCMRWD13_DIGRF_DBG_DIS_CM7_2_SHIFT (6U)
#define DCM_GPR_DCMRWD13_DIGRF_DBG_DIS_CM7_2_WIDTH (1U)
#define DCM_GPR_DCMRWD13_DIGRF_DBG_DIS_CM7_2(x)  (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD13_DIGRF_DBG_DIS_CM7_2_SHIFT)) & DCM_GPR_DCMRWD13_DIGRF_DBG_DIS_CM7_2_MASK)

#define DCM_GPR_DCMRWD13_DSPI_DBG_DIS_CM7_2_MASK (0x80U)
#define DCM_GPR_DCMRWD13_DSPI_DBG_DIS_CM7_2_SHIFT (7U)
#define DCM_GPR_DCMRWD13_DSPI_DBG_DIS_CM7_2_WIDTH (1U)
#define DCM_GPR_DCMRWD13_DSPI_DBG_DIS_CM7_2(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD13_DSPI_DBG_DIS_CM7_2_SHIFT)) & DCM_GPR_DCMRWD13_DSPI_DBG_DIS_CM7_2_MASK)

#define DCM_GPR_DCMRWD13_eFlexPWM0_DBG_DIS_CM7_2_MASK (0x100U)
#define DCM_GPR_DCMRWD13_eFlexPWM0_DBG_DIS_CM7_2_SHIFT (8U)
#define DCM_GPR_DCMRWD13_eFlexPWM0_DBG_DIS_CM7_2_WIDTH (1U)
#define DCM_GPR_DCMRWD13_eFlexPWM0_DBG_DIS_CM7_2(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD13_eFlexPWM0_DBG_DIS_CM7_2_SHIFT)) & DCM_GPR_DCMRWD13_eFlexPWM0_DBG_DIS_CM7_2_MASK)

#define DCM_GPR_DCMRWD13_eFlexPWM1_DBG_DIS_CM7_2_MASK (0x200U)
#define DCM_GPR_DCMRWD13_eFlexPWM1_DBG_DIS_CM7_2_SHIFT (9U)
#define DCM_GPR_DCMRWD13_eFlexPWM1_DBG_DIS_CM7_2_WIDTH (1U)
#define DCM_GPR_DCMRWD13_eFlexPWM1_DBG_DIS_CM7_2(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD13_eFlexPWM1_DBG_DIS_CM7_2_SHIFT)) & DCM_GPR_DCMRWD13_eFlexPWM1_DBG_DIS_CM7_2_MASK)

#define DCM_GPR_DCMRWD13_SIPI_DBG_DIS_CM7_2_MASK (0x400U)
#define DCM_GPR_DCMRWD13_SIPI_DBG_DIS_CM7_2_SHIFT (10U)
#define DCM_GPR_DCMRWD13_SIPI_DBG_DIS_CM7_2_WIDTH (1U)
#define DCM_GPR_DCMRWD13_SIPI_DBG_DIS_CM7_2(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD13_SIPI_DBG_DIS_CM7_2_SHIFT)) & DCM_GPR_DCMRWD13_SIPI_DBG_DIS_CM7_2_MASK)

#define DCM_GPR_DCMRWD13_ETPU_DBG_DIS_CM7_2_MASK (0x800U)
#define DCM_GPR_DCMRWD13_ETPU_DBG_DIS_CM7_2_SHIFT (11U)
#define DCM_GPR_DCMRWD13_ETPU_DBG_DIS_CM7_2_WIDTH (1U)
#define DCM_GPR_DCMRWD13_ETPU_DBG_DIS_CM7_2(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD13_ETPU_DBG_DIS_CM7_2_SHIFT)) & DCM_GPR_DCMRWD13_ETPU_DBG_DIS_CM7_2_MASK)

#define DCM_GPR_DCMRWD13_IGF0_DBG_DIS_CM7_2_MASK (0x1000U)
#define DCM_GPR_DCMRWD13_IGF0_DBG_DIS_CM7_2_SHIFT (12U)
#define DCM_GPR_DCMRWD13_IGF0_DBG_DIS_CM7_2_WIDTH (1U)
#define DCM_GPR_DCMRWD13_IGF0_DBG_DIS_CM7_2(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD13_IGF0_DBG_DIS_CM7_2_SHIFT)) & DCM_GPR_DCMRWD13_IGF0_DBG_DIS_CM7_2_MASK)

#define DCM_GPR_DCMRWD13_IGF1_DBG_DIS_CM7_2_MASK (0x2000U)
#define DCM_GPR_DCMRWD13_IGF1_DBG_DIS_CM7_2_SHIFT (13U)
#define DCM_GPR_DCMRWD13_IGF1_DBG_DIS_CM7_2_WIDTH (1U)
#define DCM_GPR_DCMRWD13_IGF1_DBG_DIS_CM7_2(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD13_IGF1_DBG_DIS_CM7_2_SHIFT)) & DCM_GPR_DCMRWD13_IGF1_DBG_DIS_CM7_2_MASK)

#define DCM_GPR_DCMRWD13_EDMA1_DBG_DIS_CM7_2_MASK (0x4000U)
#define DCM_GPR_DCMRWD13_EDMA1_DBG_DIS_CM7_2_SHIFT (14U)
#define DCM_GPR_DCMRWD13_EDMA1_DBG_DIS_CM7_2_WIDTH (1U)
#define DCM_GPR_DCMRWD13_EDMA1_DBG_DIS_CM7_2(x)  (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD13_EDMA1_DBG_DIS_CM7_2_SHIFT)) & DCM_GPR_DCMRWD13_EDMA1_DBG_DIS_CM7_2_MASK)

#define DCM_GPR_DCMRWD13_SWG0_DBG_DIS_CM7_2_MASK (0x8000U)
#define DCM_GPR_DCMRWD13_SWG0_DBG_DIS_CM7_2_SHIFT (15U)
#define DCM_GPR_DCMRWD13_SWG0_DBG_DIS_CM7_2_WIDTH (1U)
#define DCM_GPR_DCMRWD13_SWG0_DBG_DIS_CM7_2(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD13_SWG0_DBG_DIS_CM7_2_SHIFT)) & DCM_GPR_DCMRWD13_SWG0_DBG_DIS_CM7_2_MASK)

