zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K39_DCM_GPR.h
#define DCM_GPR_DCMRWD14_SAR_ADC2_CF_ERR_EN_MASK (0x2000U)
#define DCM_GPR_DCMRWD14_SAR_ADC2_CF_ERR_EN_SHIFT (13U)
#define DCM_GPR_DCMRWD14_SAR_ADC2_CF_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD14_SAR_ADC2_CF_ERR_EN(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD14_SAR_ADC2_CF_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD14_SAR_ADC2_CF_ERR_EN_MASK)

#define DCM_GPR_DCMRWD14_SAR_ADC3_CF_ERR_EN_MASK (0x4000U)
#define DCM_GPR_DCMRWD14_SAR_ADC3_CF_ERR_EN_SHIFT (14U)
#define DCM_GPR_DCMRWD14_SAR_ADC3_CF_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD14_SAR_ADC3_CF_ERR_EN(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD14_SAR_ADC3_CF_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD14_SAR_ADC3_CF_ERR_EN_MASK)

#define DCM_GPR_DCMRWD14_SAR_ADC4_CF_ERR_EN_MASK (0x8000U)
#define DCM_GPR_DCMRWD14_SAR_ADC4_CF_ERR_EN_SHIFT (15U)
#define DCM_GPR_DCMRWD14_SAR_ADC4_CF_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD14_SAR_ADC4_CF_ERR_EN(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD14_SAR_ADC4_CF_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD14_SAR_ADC4_CF_ERR_EN_MASK)

#define DCM_GPR_DCMRWD14_SAR_ADC5_CF_ERR_EN_MASK (0x10000U)
#define DCM_GPR_DCMRWD14_SAR_ADC5_CF_ERR_EN_SHIFT (16U)
#define DCM_GPR_DCMRWD14_SAR_ADC5_CF_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD14_SAR_ADC5_CF_ERR_EN(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD14_SAR_ADC5_CF_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD14_SAR_ADC5_CF_ERR_EN_MASK)

#define DCM_GPR_DCMRWD14_SAR_ADC6_CF_ERR_EN_MASK (0x20000U)
#define DCM_GPR_DCMRWD14_SAR_ADC6_CF_ERR_EN_SHIFT (17U)
#define DCM_GPR_DCMRWD14_SAR_ADC6_CF_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD14_SAR_ADC6_CF_ERR_EN(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD14_SAR_ADC6_CF_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD14_SAR_ADC6_CF_ERR_EN_MASK)

#define DCM_GPR_DCMRWD14_ETPU_GLEX_ERR_EN_MASK   (0x40000U)
#define DCM_GPR_DCMRWD14_ETPU_GLEX_ERR_EN_SHIFT  (18U)
#define DCM_GPR_DCMRWD14_ETPU_GLEX_ERR_EN_WIDTH  (1U)
#define DCM_GPR_DCMRWD14_ETPU_GLEX_ERR_EN(x)     (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD14_ETPU_GLEX_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD14_ETPU_GLEX_ERR_EN_MASK)

#define DCM_GPR_DCMRWD14_OMU_0_ALARM_EN_MASK     (0x80000U)
#define DCM_GPR_DCMRWD14_OMU_0_ALARM_EN_SHIFT    (19U)
#define DCM_GPR_DCMRWD14_OMU_0_ALARM_EN_WIDTH    (1U)
#define DCM_GPR_DCMRWD14_OMU_0_ALARM_EN(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD14_OMU_0_ALARM_EN_SHIFT)) & DCM_GPR_DCMRWD14_OMU_0_ALARM_EN_MASK)

#define DCM_GPR_DCMRWD14_OMU_1_ALARM_EN_MASK     (0x100000U)
#define DCM_GPR_DCMRWD14_OMU_1_ALARM_EN_SHIFT    (20U)
#define DCM_GPR_DCMRWD14_OMU_1_ALARM_EN_WIDTH    (1U)
#define DCM_GPR_DCMRWD14_OMU_1_ALARM_EN(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD14_OMU_1_ALARM_EN_SHIFT)) & DCM_GPR_DCMRWD14_OMU_1_ALARM_EN_MASK)

#define DCM_GPR_DCMRWD14_OMU_2_ALARM_EN_MASK     (0x200000U)
#define DCM_GPR_DCMRWD14_OMU_2_ALARM_EN_SHIFT    (21U)
#define DCM_GPR_DCMRWD14_OMU_2_ALARM_EN_WIDTH    (1U)
#define DCM_GPR_DCMRWD14_OMU_2_ALARM_EN(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD14_OMU_2_ALARM_EN_SHIFT)) & DCM_GPR_DCMRWD14_OMU_2_ALARM_EN_MASK)

#define DCM_GPR_DCMRWD14_CM7_2_RCCU1_ALARM_EN_MASK (0x400000U)
#define DCM_GPR_DCMRWD14_CM7_2_RCCU1_ALARM_EN_SHIFT (22U)
#define DCM_GPR_DCMRWD14_CM7_2_RCCU1_ALARM_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD14_CM7_2_RCCU1_ALARM_EN(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD14_CM7_2_RCCU1_ALARM_EN_SHIFT)) & DCM_GPR_DCMRWD14_CM7_2_RCCU1_ALARM_EN_MASK)

#define DCM_GPR_DCMRWD14_CM7_2_RCCU2_ALARM_EN_MASK (0x800000U)
#define DCM_GPR_DCMRWD14_CM7_2_RCCU2_ALARM_EN_SHIFT (23U)
#define DCM_GPR_DCMRWD14_CM7_2_RCCU2_ALARM_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD14_CM7_2_RCCU2_ALARM_EN(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD14_CM7_2_RCCU2_ALARM_EN_SHIFT)) & DCM_GPR_DCMRWD14_CM7_2_RCCU2_ALARM_EN_MASK)

#define DCM_GPR_DCMRWD14_eDMA1_RCCU1_ALARM_EN_MASK (0x1000000U)
#define DCM_GPR_DCMRWD14_eDMA1_RCCU1_ALARM_EN_SHIFT (24U)
#define DCM_GPR_DCMRWD14_eDMA1_RCCU1_ALARM_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD14_eDMA1_RCCU1_ALARM_EN(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD14_eDMA1_RCCU1_ALARM_EN_SHIFT)) & DCM_GPR_DCMRWD14_eDMA1_RCCU1_ALARM_EN_MASK)

#define DCM_GPR_DCMRWD14_eDMA1_RCCU2_ALARM_EN_MASK (0x2000000U)
#define DCM_GPR_DCMRWD14_eDMA1_RCCU2_ALARM_EN_SHIFT (25U)
#define DCM_GPR_DCMRWD14_eDMA1_RCCU2_ALARM_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD14_eDMA1_RCCU2_ALARM_EN(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD14_eDMA1_RCCU2_ALARM_EN_SHIFT)) & DCM_GPR_DCMRWD14_eDMA1_RCCU2_ALARM_EN_MASK)

#define DCM_GPR_DCMRWD14_DMA1_SYS_GSKT_ALARM_EN_MASK (0x8000000U)
#define DCM_GPR_DCMRWD14_DMA1_SYS_GSKT_ALARM_EN_SHIFT (27U)
#define DCM_GPR_DCMRWD14_DMA1_SYS_GSKT_ALARM_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD14_DMA1_SYS_GSKT_ALARM_EN(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD14_DMA1_SYS_GSKT_ALARM_EN_SHIFT)) & DCM_GPR_DCMRWD14_DMA1_SYS_GSKT_ALARM_EN_MASK)

#define DCM_GPR_DCMRWD14_DMA1_PERIPH_GSKT_ALARM_EN_MASK (0x10000000U)
#define DCM_GPR_DCMRWD14_DMA1_PERIPH_GSKT_ALARM_EN_SHIFT (28U)
#define DCM_GPR_DCMRWD14_DMA1_PERIPH_GSKT_ALARM_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD14_DMA1_PERIPH_GSKT_ALARM_EN(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD14_DMA1_PERIPH_GSKT_ALARM_EN_SHIFT)) & DCM_GPR_DCMRWD14_DMA1_PERIPH_GSKT_ALARM_EN_MASK)

#define DCM_GPR_DCMRWD14_ZIPWIRE_GSKT_ALARM_EN_MASK (0x20000000U)
#define DCM_GPR_DCMRWD14_ZIPWIRE_GSKT_ALARM_EN_SHIFT (29U)
#define DCM_GPR_DCMRWD14_ZIPWIRE_GSKT_ALARM_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD14_ZIPWIRE_GSKT_ALARM_EN(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD14_ZIPWIRE_GSKT_ALARM_EN_SHIFT)) & DCM_GPR_DCMRWD14_ZIPWIRE_GSKT_ALARM_EN_MASK)

#define DCM_GPR_DCMRWD14_DMA1_AXBS_ALARM_EN_MASK (0x80000000U)
#define DCM_GPR_DCMRWD14_DMA1_AXBS_ALARM_EN_SHIFT (31U)
#define DCM_GPR_DCMRWD14_DMA1_AXBS_ALARM_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD14_DMA1_AXBS_ALARM_EN(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD14_DMA1_AXBS_ALARM_EN_SHIFT)) & DCM_GPR_DCMRWD14_DMA1_AXBS_ALARM_EN_MASK)
/*! @} */

/*! @name DCMRWD15 - Read Write GPR On Destructive Reset 15 */
/*! @{ */

#define DCM_GPR_DCMRWD15_CM7_0_AHBM_ALARM_EN_MASK (0x1U)
#define DCM_GPR_DCMRWD15_CM7_0_AHBM_ALARM_EN_SHIFT (0U)
#define DCM_GPR_DCMRWD15_CM7_0_AHBM_ALARM_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD15_CM7_0_AHBM_ALARM_EN(x)  (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD15_CM7_0_AHBM_ALARM_EN_SHIFT)) & DCM_GPR_DCMRWD15_CM7_0_AHBM_ALARM_EN_MASK)

#define DCM_GPR_DCMRWD15_CM7_1_AHBM_ALARM_EN_MASK (0x2U)
#define DCM_GPR_DCMRWD15_CM7_1_AHBM_ALARM_EN_SHIFT (1U)
#define DCM_GPR_DCMRWD15_CM7_1_AHBM_ALARM_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD15_CM7_1_AHBM_ALARM_EN(x)  (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD15_CM7_1_AHBM_ALARM_EN_SHIFT)) & DCM_GPR_DCMRWD15_CM7_1_AHBM_ALARM_EN_MASK)

#define DCM_GPR_DCMRWD15_CM7_2_AHBM_ALARM_EN_MASK (0x4U)
#define DCM_GPR_DCMRWD15_CM7_2_AHBM_ALARM_EN_SHIFT (2U)
#define DCM_GPR_DCMRWD15_CM7_2_AHBM_ALARM_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD15_CM7_2_AHBM_ALARM_EN(x)  (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD15_CM7_2_AHBM_ALARM_EN_SHIFT)) & DCM_GPR_DCMRWD15_CM7_2_AHBM_ALARM_EN_MASK)

#define DCM_GPR_DCMRWD15_CM7_0_AHBP_ALARM_EN_MASK (0x8U)
#define DCM_GPR_DCMRWD15_CM7_0_AHBP_ALARM_EN_SHIFT (3U)
#define DCM_GPR_DCMRWD15_CM7_0_AHBP_ALARM_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD15_CM7_0_AHBP_ALARM_EN(x)  (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD15_CM7_0_AHBP_ALARM_EN_SHIFT)) & DCM_GPR_DCMRWD15_CM7_0_AHBP_ALARM_EN_MASK)

#define DCM_GPR_DCMRWD15_CM7_1_AHBP_ALARM_EN_MASK (0x10U)
#define DCM_GPR_DCMRWD15_CM7_1_AHBP_ALARM_EN_SHIFT (4U)
#define DCM_GPR_DCMRWD15_CM7_1_AHBP_ALARM_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD15_CM7_1_AHBP_ALARM_EN(x)  (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD15_CM7_1_AHBP_ALARM_EN_SHIFT)) & DCM_GPR_DCMRWD15_CM7_1_AHBP_ALARM_EN_MASK)

#define DCM_GPR_DCMRWD15_CM7_2_AHBP_ALARM_EN_MASK (0x20U)
#define DCM_GPR_DCMRWD15_CM7_2_AHBP_ALARM_EN_SHIFT (5U)
#define DCM_GPR_DCMRWD15_CM7_2_AHBP_ALARM_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD15_CM7_2_AHBP_ALARM_EN(x)  (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD15_CM7_2_AHBP_ALARM_EN_SHIFT)) & DCM_GPR_DCMRWD15_CM7_2_AHBP_ALARM_EN_MASK)

#define DCM_GPR_DCMRWD15_ZIPWIRE_AXBS_ALARM_EN_MASK (0x40U)
#define DCM_GPR_DCMRWD15_ZIPWIRE_AXBS_ALARM_EN_SHIFT (6U)
#define DCM_GPR_DCMRWD15_ZIPWIRE_AXBS_ALARM_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD15_ZIPWIRE_AXBS_ALARM_EN(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD15_ZIPWIRE_AXBS_ALARM_EN_SHIFT)) & DCM_GPR_DCMRWD15_ZIPWIRE_AXBS_ALARM_EN_MASK)

#define DCM_GPR_DCMRWD15_LVDS_3P3V_RX_FAULT_EN_MASK (0x80U)
#define DCM_GPR_DCMRWD15_LVDS_3P3V_RX_FAULT_EN_SHIFT (7U)
#define DCM_GPR_DCMRWD15_LVDS_3P3V_RX_FAULT_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD15_LVDS_3P3V_RX_FAULT_EN(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD15_LVDS_3P3V_RX_FAULT_EN_SHIFT)) & DCM_GPR_DCMRWD15_LVDS_3P3V_RX_FAULT_EN_MASK)

#define DCM_GPR_DCMRWD15_VDDA_SDADC0_GNG_ERR_EN_MASK (0x100U)
#define DCM_GPR_DCMRWD15_VDDA_SDADC0_GNG_ERR_EN_SHIFT (8U)
#define DCM_GPR_DCMRWD15_VDDA_SDADC0_GNG_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD15_VDDA_SDADC0_GNG_ERR_EN(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD15_VDDA_SDADC0_GNG_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD15_VDDA_SDADC0_GNG_ERR_EN_MASK)

