zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K39_DCM_GPR.h
#define DCM_GPR_DCMRWD15_VDDA_SDADC1_GNG_ERR_EN_MASK (0x200U)
#define DCM_GPR_DCMRWD15_VDDA_SDADC1_GNG_ERR_EN_SHIFT (9U)
#define DCM_GPR_DCMRWD15_VDDA_SDADC1_GNG_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD15_VDDA_SDADC1_GNG_ERR_EN(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD15_VDDA_SDADC1_GNG_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD15_VDDA_SDADC1_GNG_ERR_EN_MASK)

#define DCM_GPR_DCMRWD15_VDDA_SWG_GNG_ERR_EN_MASK (0x400U)
#define DCM_GPR_DCMRWD15_VDDA_SWG_GNG_ERR_EN_SHIFT (10U)
#define DCM_GPR_DCMRWD15_VDDA_SWG_GNG_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD15_VDDA_SWG_GNG_ERR_EN(x)  (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD15_VDDA_SWG_GNG_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD15_VDDA_SWG_GNG_ERR_EN_MASK)

#define DCM_GPR_DCMRWD15_VDD1P1_GNG2_ERR_EN_MASK (0x800U)
#define DCM_GPR_DCMRWD15_VDD1P1_GNG2_ERR_EN_SHIFT (11U)
#define DCM_GPR_DCMRWD15_VDD1P1_GNG2_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD15_VDD1P1_GNG2_ERR_EN(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD15_VDD1P1_GNG2_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD15_VDD1P1_GNG2_ERR_EN_MASK)

#define DCM_GPR_DCMRWD15_VDD2P5_GNG2_ERR_EN_MASK (0x1000U)
#define DCM_GPR_DCMRWD15_VDD2P5_GNG2_ERR_EN_SHIFT (12U)
#define DCM_GPR_DCMRWD15_VDD2P5_GNG2_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD15_VDD2P5_GNG2_ERR_EN(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD15_VDD2P5_GNG2_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD15_VDD2P5_GNG2_ERR_EN_MASK)

#define DCM_GPR_DCMRWD15_XMEM_EVEN_ECC_CORE_ERR_EN_MASK (0x2000U)
#define DCM_GPR_DCMRWD15_XMEM_EVEN_ECC_CORE_ERR_EN_SHIFT (13U)
#define DCM_GPR_DCMRWD15_XMEM_EVEN_ECC_CORE_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD15_XMEM_EVEN_ECC_CORE_ERR_EN(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD15_XMEM_EVEN_ECC_CORE_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD15_XMEM_EVEN_ECC_CORE_ERR_EN_MASK)

#define DCM_GPR_DCMRWD15_PMEM_ECC_CORE_ERR_EN_MASK (0x4000U)
#define DCM_GPR_DCMRWD15_PMEM_ECC_CORE_ERR_EN_SHIFT (14U)
#define DCM_GPR_DCMRWD15_PMEM_ECC_CORE_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD15_PMEM_ECC_CORE_ERR_EN(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD15_PMEM_ECC_CORE_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD15_PMEM_ECC_CORE_ERR_EN_MASK)

#define DCM_GPR_DCMRWD15_XMEM_ODD_ECC0_DSP_ERR_EN_MASK (0x8000U)
#define DCM_GPR_DCMRWD15_XMEM_ODD_ECC0_DSP_ERR_EN_SHIFT (15U)
#define DCM_GPR_DCMRWD15_XMEM_ODD_ECC0_DSP_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD15_XMEM_ODD_ECC0_DSP_ERR_EN(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD15_XMEM_ODD_ECC0_DSP_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD15_XMEM_ODD_ECC0_DSP_ERR_EN_MASK)

#define DCM_GPR_DCMRWD15_XMEM_ODD_ECC1_DSP_ERR_EN_MASK (0x10000U)
#define DCM_GPR_DCMRWD15_XMEM_ODD_ECC1_DSP_ERR_EN_SHIFT (16U)
#define DCM_GPR_DCMRWD15_XMEM_ODD_ECC1_DSP_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD15_XMEM_ODD_ECC1_DSP_ERR_EN(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD15_XMEM_ODD_ECC1_DSP_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD15_XMEM_ODD_ECC1_DSP_ERR_EN_MASK)

#define DCM_GPR_DCMRWD15_XMEM_ODD_ECC2_DSP_ERR_EN_MASK (0x20000U)
#define DCM_GPR_DCMRWD15_XMEM_ODD_ECC2_DSP_ERR_EN_SHIFT (17U)
#define DCM_GPR_DCMRWD15_XMEM_ODD_ECC2_DSP_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD15_XMEM_ODD_ECC2_DSP_ERR_EN(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD15_XMEM_ODD_ECC2_DSP_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD15_XMEM_ODD_ECC2_DSP_ERR_EN_MASK)

#define DCM_GPR_DCMRWD15_XMEM_ODD_ECC3_DSP_ERR_EN_MASK (0x40000U)
#define DCM_GPR_DCMRWD15_XMEM_ODD_ECC3_DSP_ERR_EN_SHIFT (18U)
#define DCM_GPR_DCMRWD15_XMEM_ODD_ECC3_DSP_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD15_XMEM_ODD_ECC3_DSP_ERR_EN(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD15_XMEM_ODD_ECC3_DSP_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD15_XMEM_ODD_ECC3_DSP_ERR_EN_MASK)

#define DCM_GPR_DCMRWD15_XMEM_EVEN_ECC0_DSP_ERR_EN_MASK (0x80000U)
#define DCM_GPR_DCMRWD15_XMEM_EVEN_ECC0_DSP_ERR_EN_SHIFT (19U)
#define DCM_GPR_DCMRWD15_XMEM_EVEN_ECC0_DSP_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD15_XMEM_EVEN_ECC0_DSP_ERR_EN(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD15_XMEM_EVEN_ECC0_DSP_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD15_XMEM_EVEN_ECC0_DSP_ERR_EN_MASK)

#define DCM_GPR_DCMRWD15_XMEM_EVEN_ECC1_DSP_ERR_EN_MASK (0x100000U)
#define DCM_GPR_DCMRWD15_XMEM_EVEN_ECC1_DSP_ERR_EN_SHIFT (20U)
#define DCM_GPR_DCMRWD15_XMEM_EVEN_ECC1_DSP_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD15_XMEM_EVEN_ECC1_DSP_ERR_EN(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD15_XMEM_EVEN_ECC1_DSP_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD15_XMEM_EVEN_ECC1_DSP_ERR_EN_MASK)

#define DCM_GPR_DCMRWD15_XMEM_EVEN_ECC2_DSP_ERR_EN_MASK (0x200000U)
#define DCM_GPR_DCMRWD15_XMEM_EVEN_ECC2_DSP_ERR_EN_SHIFT (21U)
#define DCM_GPR_DCMRWD15_XMEM_EVEN_ECC2_DSP_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD15_XMEM_EVEN_ECC2_DSP_ERR_EN(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD15_XMEM_EVEN_ECC2_DSP_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD15_XMEM_EVEN_ECC2_DSP_ERR_EN_MASK)

#define DCM_GPR_DCMRWD15_XMEM_EVEN_ECC3_DSP_ERR_EN_MASK (0x400000U)
#define DCM_GPR_DCMRWD15_XMEM_EVEN_ECC3_DSP_ERR_EN_SHIFT (22U)
#define DCM_GPR_DCMRWD15_XMEM_EVEN_ECC3_DSP_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD15_XMEM_EVEN_ECC3_DSP_ERR_EN(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD15_XMEM_EVEN_ECC3_DSP_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD15_XMEM_EVEN_ECC3_DSP_ERR_EN_MASK)

#define DCM_GPR_DCMRWD15_PMEM_ECC0_DSP_ERR_EN_MASK (0x800000U)
#define DCM_GPR_DCMRWD15_PMEM_ECC0_DSP_ERR_EN_SHIFT (23U)
#define DCM_GPR_DCMRWD15_PMEM_ECC0_DSP_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD15_PMEM_ECC0_DSP_ERR_EN(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD15_PMEM_ECC0_DSP_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD15_PMEM_ECC0_DSP_ERR_EN_MASK)

#define DCM_GPR_DCMRWD15_PMEM_ECC1_DSP_ERR_EN_MASK (0x1000000U)
#define DCM_GPR_DCMRWD15_PMEM_ECC1_DSP_ERR_EN_SHIFT (24U)
#define DCM_GPR_DCMRWD15_PMEM_ECC1_DSP_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD15_PMEM_ECC1_DSP_ERR_EN(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD15_PMEM_ECC1_DSP_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD15_PMEM_ECC1_DSP_ERR_EN_MASK)

#define DCM_GPR_DCMRWD15_PMEM_ECC2_DSP_ERR_EN_MASK (0x2000000U)
#define DCM_GPR_DCMRWD15_PMEM_ECC2_DSP_ERR_EN_SHIFT (25U)
#define DCM_GPR_DCMRWD15_PMEM_ECC2_DSP_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD15_PMEM_ECC2_DSP_ERR_EN(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD15_PMEM_ECC2_DSP_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD15_PMEM_ECC2_DSP_ERR_EN_MASK)

#define DCM_GPR_DCMRWD15_PMEM_ECC3_DSP_ERR_EN_MASK (0x4000000U)
#define DCM_GPR_DCMRWD15_PMEM_ECC3_DSP_ERR_EN_SHIFT (26U)
#define DCM_GPR_DCMRWD15_PMEM_ECC3_DSP_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD15_PMEM_ECC3_DSP_ERR_EN(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD15_PMEM_ECC3_DSP_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD15_PMEM_ECC3_DSP_ERR_EN_MASK)

#define DCM_GPR_DCMRWD15_XMEM_ODD_ECC_CORE_ERR_EN_MASK (0x8000000U)
#define DCM_GPR_DCMRWD15_XMEM_ODD_ECC_CORE_ERR_EN_SHIFT (27U)
#define DCM_GPR_DCMRWD15_XMEM_ODD_ECC_CORE_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD15_XMEM_ODD_ECC_CORE_ERR_EN(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD15_XMEM_ODD_ECC_CORE_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD15_XMEM_ODD_ECC_CORE_ERR_EN_MASK)

#define DCM_GPR_DCMRWD15_CM7_0_AHBS_ALARM_EN_MASK (0x10000000U)
#define DCM_GPR_DCMRWD15_CM7_0_AHBS_ALARM_EN_SHIFT (28U)
#define DCM_GPR_DCMRWD15_CM7_0_AHBS_ALARM_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD15_CM7_0_AHBS_ALARM_EN(x)  (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD15_CM7_0_AHBS_ALARM_EN_SHIFT)) & DCM_GPR_DCMRWD15_CM7_0_AHBS_ALARM_EN_MASK)

#define DCM_GPR_DCMRWD15_CM7_1_AHBS_ALARM_EN_MASK (0x20000000U)
#define DCM_GPR_DCMRWD15_CM7_1_AHBS_ALARM_EN_SHIFT (29U)
#define DCM_GPR_DCMRWD15_CM7_1_AHBS_ALARM_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD15_CM7_1_AHBS_ALARM_EN(x)  (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD15_CM7_1_AHBS_ALARM_EN_SHIFT)) & DCM_GPR_DCMRWD15_CM7_1_AHBS_ALARM_EN_MASK)

#define DCM_GPR_DCMRWD15_CM7_2_AHBS_ALARM_EN_MASK (0x40000000U)
#define DCM_GPR_DCMRWD15_CM7_2_AHBS_ALARM_EN_SHIFT (30U)
#define DCM_GPR_DCMRWD15_CM7_2_AHBS_ALARM_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD15_CM7_2_AHBS_ALARM_EN(x)  (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD15_CM7_2_AHBS_ALARM_EN_SHIFT)) & DCM_GPR_DCMRWD15_CM7_2_AHBS_ALARM_EN_MASK)
/*! @} */

