zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K39_DCM_GPR.h
#define DCM_GPR_DCMRWF2_PMOS_CTRL_GPIO_DATA_MASK (0x100U)
#define DCM_GPR_DCMRWF2_PMOS_CTRL_GPIO_DATA_SHIFT (8U)
#define DCM_GPR_DCMRWF2_PMOS_CTRL_GPIO_DATA_WIDTH (1U)
#define DCM_GPR_DCMRWF2_PMOS_CTRL_GPIO_DATA(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF2_PMOS_CTRL_GPIO_DATA_SHIFT)) & DCM_GPR_DCMRWF2_PMOS_CTRL_GPIO_DATA_MASK)

#define DCM_GPR_DCMRWF2_SUPPLY2_MON_EN_MASK      (0x1000U)
#define DCM_GPR_DCMRWF2_SUPPLY2_MON_EN_SHIFT     (12U)
#define DCM_GPR_DCMRWF2_SUPPLY2_MON_EN_WIDTH     (1U)
#define DCM_GPR_DCMRWF2_SUPPLY2_MON_EN(x)        (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF2_SUPPLY2_MON_EN_SHIFT)) & DCM_GPR_DCMRWF2_SUPPLY2_MON_EN_MASK)

#define DCM_GPR_DCMRWF2_SUPPLY2_MON_SEL_MASK     (0xE000U)
#define DCM_GPR_DCMRWF2_SUPPLY2_MON_SEL_SHIFT    (13U)
#define DCM_GPR_DCMRWF2_SUPPLY2_MON_SEL_WIDTH    (3U)
#define DCM_GPR_DCMRWF2_SUPPLY2_MON_SEL(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF2_SUPPLY2_MON_SEL_SHIFT)) & DCM_GPR_DCMRWF2_SUPPLY2_MON_SEL_MASK)

#define DCM_GPR_DCMRWF2_HSE_GSKT_BYPASS_MASK     (0x10000U)
#define DCM_GPR_DCMRWF2_HSE_GSKT_BYPASS_SHIFT    (16U)
#define DCM_GPR_DCMRWF2_HSE_GSKT_BYPASS_WIDTH    (1U)
#define DCM_GPR_DCMRWF2_HSE_GSKT_BYPASS(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF2_HSE_GSKT_BYPASS_SHIFT)) & DCM_GPR_DCMRWF2_HSE_GSKT_BYPASS_MASK)

#define DCM_GPR_DCMRWF2_PGOOD_POLARITY_MASK      (0x200000U)
#define DCM_GPR_DCMRWF2_PGOOD_POLARITY_SHIFT     (21U)
#define DCM_GPR_DCMRWF2_PGOOD_POLARITY_WIDTH     (1U)
#define DCM_GPR_DCMRWF2_PGOOD_POLARITY(x)        (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF2_PGOOD_POLARITY_SHIFT)) & DCM_GPR_DCMRWF2_PGOOD_POLARITY_MASK)

#define DCM_GPR_DCMRWF2_WKPU18_SRC_SELECT_MASK   (0x10000000U)
#define DCM_GPR_DCMRWF2_WKPU18_SRC_SELECT_SHIFT  (28U)
#define DCM_GPR_DCMRWF2_WKPU18_SRC_SELECT_WIDTH  (1U)
#define DCM_GPR_DCMRWF2_WKPU18_SRC_SELECT(x)     (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF2_WKPU18_SRC_SELECT_SHIFT)) & DCM_GPR_DCMRWF2_WKPU18_SRC_SELECT_MASK)

#define DCM_GPR_DCMRWF2_WKPU27_SRC_SELECT_MASK   (0x20000000U)
#define DCM_GPR_DCMRWF2_WKPU27_SRC_SELECT_SHIFT  (29U)
#define DCM_GPR_DCMRWF2_WKPU27_SRC_SELECT_WIDTH  (1U)
#define DCM_GPR_DCMRWF2_WKPU27_SRC_SELECT(x)     (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF2_WKPU27_SRC_SELECT_SHIFT)) & DCM_GPR_DCMRWF2_WKPU27_SRC_SELECT_MASK)

#define DCM_GPR_DCMRWF2_WKPU45_SRC_SELECT_MASK   (0x40000000U)
#define DCM_GPR_DCMRWF2_WKPU45_SRC_SELECT_SHIFT  (30U)
#define DCM_GPR_DCMRWF2_WKPU45_SRC_SELECT_WIDTH  (1U)
#define DCM_GPR_DCMRWF2_WKPU45_SRC_SELECT(x)     (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF2_WKPU45_SRC_SELECT_SHIFT)) & DCM_GPR_DCMRWF2_WKPU45_SRC_SELECT_MASK)

#define DCM_GPR_DCMRWF2_WKPU8_SRC_SELECT_MASK    (0x80000000U)
#define DCM_GPR_DCMRWF2_WKPU8_SRC_SELECT_SHIFT   (31U)
#define DCM_GPR_DCMRWF2_WKPU8_SRC_SELECT_WIDTH   (1U)
#define DCM_GPR_DCMRWF2_WKPU8_SRC_SELECT(x)      (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF2_WKPU8_SRC_SELECT_SHIFT)) & DCM_GPR_DCMRWF2_WKPU8_SRC_SELECT_MASK)
/*! @} */

/*! @name DCMRWF3 - Read Write GPR On Functional Reset 3 */
/*! @{ */

#define DCM_GPR_DCMRWF3_WKPU17_SRC_SELECT_MASK   (0x1U)
#define DCM_GPR_DCMRWF3_WKPU17_SRC_SELECT_SHIFT  (0U)
#define DCM_GPR_DCMRWF3_WKPU17_SRC_SELECT_WIDTH  (1U)
#define DCM_GPR_DCMRWF3_WKPU17_SRC_SELECT(x)     (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF3_WKPU17_SRC_SELECT_SHIFT)) & DCM_GPR_DCMRWF3_WKPU17_SRC_SELECT_MASK)

#define DCM_GPR_DCMRWF3_WKPU2_SRC_SELECT_MASK    (0x2U)
#define DCM_GPR_DCMRWF3_WKPU2_SRC_SELECT_SHIFT   (1U)
#define DCM_GPR_DCMRWF3_WKPU2_SRC_SELECT_WIDTH   (1U)
#define DCM_GPR_DCMRWF3_WKPU2_SRC_SELECT(x)      (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF3_WKPU2_SRC_SELECT_SHIFT)) & DCM_GPR_DCMRWF3_WKPU2_SRC_SELECT_MASK)

#define DCM_GPR_DCMRWF3_WKPU20_SRC_SELECT_MASK   (0x4U)
#define DCM_GPR_DCMRWF3_WKPU20_SRC_SELECT_SHIFT  (2U)
#define DCM_GPR_DCMRWF3_WKPU20_SRC_SELECT_WIDTH  (1U)
#define DCM_GPR_DCMRWF3_WKPU20_SRC_SELECT(x)     (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF3_WKPU20_SRC_SELECT_SHIFT)) & DCM_GPR_DCMRWF3_WKPU20_SRC_SELECT_MASK)

#define DCM_GPR_DCMRWF3_WKPU25_SRC_SELECT_MASK   (0x8U)
#define DCM_GPR_DCMRWF3_WKPU25_SRC_SELECT_SHIFT  (3U)
#define DCM_GPR_DCMRWF3_WKPU25_SRC_SELECT_WIDTH  (1U)
#define DCM_GPR_DCMRWF3_WKPU25_SRC_SELECT(x)     (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF3_WKPU25_SRC_SELECT_SHIFT)) & DCM_GPR_DCMRWF3_WKPU25_SRC_SELECT_MASK)

#define DCM_GPR_DCMRWF3_WKPU29_SRC_SELECT_MASK   (0x10U)
#define DCM_GPR_DCMRWF3_WKPU29_SRC_SELECT_SHIFT  (4U)
#define DCM_GPR_DCMRWF3_WKPU29_SRC_SELECT_WIDTH  (1U)
#define DCM_GPR_DCMRWF3_WKPU29_SRC_SELECT(x)     (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF3_WKPU29_SRC_SELECT_SHIFT)) & DCM_GPR_DCMRWF3_WKPU29_SRC_SELECT_MASK)

#define DCM_GPR_DCMRWF3_WKPU3_SRC_SELECT_MASK    (0x20U)
#define DCM_GPR_DCMRWF3_WKPU3_SRC_SELECT_SHIFT   (5U)
#define DCM_GPR_DCMRWF3_WKPU3_SRC_SELECT_WIDTH   (1U)
#define DCM_GPR_DCMRWF3_WKPU3_SRC_SELECT(x)      (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF3_WKPU3_SRC_SELECT_SHIFT)) & DCM_GPR_DCMRWF3_WKPU3_SRC_SELECT_MASK)

#define DCM_GPR_DCMRWF3_WKPU31_SRC_SELECT_MASK   (0x40U)
#define DCM_GPR_DCMRWF3_WKPU31_SRC_SELECT_SHIFT  (6U)
#define DCM_GPR_DCMRWF3_WKPU31_SRC_SELECT_WIDTH  (1U)
#define DCM_GPR_DCMRWF3_WKPU31_SRC_SELECT(x)     (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF3_WKPU31_SRC_SELECT_SHIFT)) & DCM_GPR_DCMRWF3_WKPU31_SRC_SELECT_MASK)

#define DCM_GPR_DCMRWF3_WKPU5_SRC_SELECT_MASK    (0x80U)
#define DCM_GPR_DCMRWF3_WKPU5_SRC_SELECT_SHIFT   (7U)
#define DCM_GPR_DCMRWF3_WKPU5_SRC_SELECT_WIDTH   (1U)
#define DCM_GPR_DCMRWF3_WKPU5_SRC_SELECT(x)      (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF3_WKPU5_SRC_SELECT_SHIFT)) & DCM_GPR_DCMRWF3_WKPU5_SRC_SELECT_MASK)

#define DCM_GPR_DCMRWF3_WKPU51_SRC_SELECT_MASK   (0x100U)
#define DCM_GPR_DCMRWF3_WKPU51_SRC_SELECT_SHIFT  (8U)
#define DCM_GPR_DCMRWF3_WKPU51_SRC_SELECT_WIDTH  (1U)
#define DCM_GPR_DCMRWF3_WKPU51_SRC_SELECT(x)     (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF3_WKPU51_SRC_SELECT_SHIFT)) & DCM_GPR_DCMRWF3_WKPU51_SRC_SELECT_MASK)

#define DCM_GPR_DCMRWF3_WKPU52_SRC_SELECT_MASK   (0x200U)
#define DCM_GPR_DCMRWF3_WKPU52_SRC_SELECT_SHIFT  (9U)
#define DCM_GPR_DCMRWF3_WKPU52_SRC_SELECT_WIDTH  (1U)
#define DCM_GPR_DCMRWF3_WKPU52_SRC_SELECT(x)     (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF3_WKPU52_SRC_SELECT_SHIFT)) & DCM_GPR_DCMRWF3_WKPU52_SRC_SELECT_MASK)

#define DCM_GPR_DCMRWF3_WKPU55_SRC_SELECT_MASK   (0x400U)
#define DCM_GPR_DCMRWF3_WKPU55_SRC_SELECT_SHIFT  (10U)
#define DCM_GPR_DCMRWF3_WKPU55_SRC_SELECT_WIDTH  (1U)
#define DCM_GPR_DCMRWF3_WKPU55_SRC_SELECT(x)     (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF3_WKPU55_SRC_SELECT_SHIFT)) & DCM_GPR_DCMRWF3_WKPU55_SRC_SELECT_MASK)

#define DCM_GPR_DCMRWF3_WKPU57_SRC_SELECT_MASK   (0x800U)
#define DCM_GPR_DCMRWF3_WKPU57_SRC_SELECT_SHIFT  (11U)
#define DCM_GPR_DCMRWF3_WKPU57_SRC_SELECT_WIDTH  (1U)
#define DCM_GPR_DCMRWF3_WKPU57_SRC_SELECT(x)     (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF3_WKPU57_SRC_SELECT_SHIFT)) & DCM_GPR_DCMRWF3_WKPU57_SRC_SELECT_MASK)

#define DCM_GPR_DCMRWF3_WKPU54_SRC_SELECT_MASK   (0x1000U)
#define DCM_GPR_DCMRWF3_WKPU54_SRC_SELECT_SHIFT  (12U)
#define DCM_GPR_DCMRWF3_WKPU54_SRC_SELECT_WIDTH  (1U)
#define DCM_GPR_DCMRWF3_WKPU54_SRC_SELECT(x)     (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF3_WKPU54_SRC_SELECT_SHIFT)) & DCM_GPR_DCMRWF3_WKPU54_SRC_SELECT_MASK)
/*! @} */

